app/views/recipe_ingredients/index.html.erb

<h2><%= @recipe.rating %></h2>
<% @recipe.recipe_ingredients.each do |ing| %>
---
SELECT  "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ? LIMIT ?  [["recipe_id", 4], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"