app/views/comments/index.html.erb

  <div class="col-md-12 text-center">
    <% @recipe.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 1]]