app/views/recipes/edit.html.erb

SELECT "ingredients".* FROM "ingredients"
---
    <%= f.label :ingredients %>
    <%= f.collection_check_boxes :ingredient_ids, Ingredient.all, :id, :ingredient_name, checked: @recipe.try(:ingredient_ids) %><br>