app/views/recipes/new.html.erb

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."ingredient_name" = ? LIMIT ?  [["ingredient_name", ""], ["LIMIT", 1]]
---
    <%= f.label "Select Existing Ingredients:" %><br>
    <%= f.collection_check_boxes :ingredient_ids, Ingredient.all, :id, :ingredient_name, checked: @recipe.try(:ingredient_ids) %><br>