app/views/recipes/show.html.erb

SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]
---
    <h2>Ingredients</h2>
    <% @recipe.recipe_ingredients.each do |ing| %>

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 1]]
---
    <h2>Comments</h2>
    <% @recipe.comments.each do |comment| %>