app/views/ingredients/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]
---
  <div class='col-md-12 text-center'>
    <% @ingredient.recipes.each do |recipe| %>

SELECT  "ingredients".* FROM "ingredients" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
      var ingredientList = '<h5>Other Ingredients in this Recipe</h5><ol>';
      for(var i = 0; i<this.ingredients.length; i++){