app/controllers/comments_controller.rb

  def new
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("user_id", "recipe_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["recipe_id", 1], ["content", "awesome!"], ["created_at", 2016-11-13 03:59:29 UTC], ["updated_at", 2016-11-13 03:59:29 UTC]]

  def index
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]