app/controllers/ingredients_controller.rb

  def create
    @ingredient = Ingredient.create(ingredient_params)
---
INSERT INTO "ingredients" ("ingredient_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["ingredient_name", "pickles"], ["created_at", 2016-11-13 01:31:15 UTC], ["updated_at", 2016-11-13 01:31:15 UTC]]

  def show
    @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]