app/controllers/recipe_ingredients_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def index
    @recipe = Recipe.find(params[:recipe_id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ? LIMIT ?  [["recipe_id", 4], ["LIMIT", 1]]
---
  def update
    @recipe = Recipe.find(params[:recipe_id])
    @recipe_ingredients = RecipeIngredient.find