app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("name", "description", "user_id", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "grandmas cookies"], ["description", "amazing cookie recipe"], ["user_id", 1], ["rating", 5], ["created_at", 2016-11-12 22:09:28 UTC], ["updated_at", 2016-11-12 22:09:28 UTC]]
---
  def create
    @recipe = Recipe.create(recipe_params)