app/controllers/recipe_ingredients_controller.rb

SELECT  "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ? LIMIT ?  [["recipe_id", 4], ["LIMIT", 1]]
---
  def index
    recipe_finder
    @recipe_id = params[:recipe_id].to_i
    @recipe_ingredients = RecipeIngredient.where(recipe_id: @recipe_id)

SELECT  "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ? AND "recipe_ingredients"."ingredient_id" = ? LIMIT ?  [["recipe_id", 1], ["ingredient_id", 2], ["LIMIT", 1]]
UPDATE "recipe_ingredients" SET "quantity" = ?, "updated_at" = ? WHERE "recipe_ingredients"."id" = ?  [["quantity", 155], ["updated_at", 2016-11-14 05:07:46 UTC], ["id", 5]]
---
  def update
    recipe_finder
    @recipe_ingredients = @recipe.recipe_ingredients
    @ing = @recipe_ingredients.find_by(ingredient_id: params[:id])
    @ing.update(recipe_ingredients_params)

SELECT  "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ? AND "recipe_ingredients"."ingredient_id" = ? LIMIT ?  [["recipe_id", 8], ["ingredient_id", 2], ["LIMIT", 1]]
---
  def edit
    recipe_finder
    @recipe_ingredient = @recipe.recipe_ingredients
    @ing = @recipe_ingredient.find_by(ingredient_id: params[:id])